In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_excel('./defaults_v2.xlsx')
df.head()

,sk_id_curr,default,name_contract_type,code_gender,flag_own_car,flag_own_realty,amt_income_total,amt_credit,name_income_type,name_education_type,name_family_status
0,413120,0,Cash loans,F,N,Y,103500.0,99504.0,Pensioner,Secondary / secondary special,Married
1,373329,0,Cash loans,M,N,N,81000.0,170640.0,Working,Secondary / secondary special,Single / not married
2,194763,0,Cash loans,F,N,Y,180000.0,282690.0,Working,Secondary / secondary special,Married
3,340263,0,Cash loans,F,N,Y,236205.0,568800.0,Commercial associate,Higher education,Married
4,450598,0,Revolving loans,F,N,Y,157500.0,382500.0,Working,Higher education,Married

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102386 entries, 0 to 102385
Data columns (total 11 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   sk_id_curr           102386 non-null  int64
 1   default              102386 non-null  int64
 2   name_contract_type   102386 non-null  object
 3   code_gender          102386 non-null  object
 4   flag_own_car         102386 non-null  object
 5   flag_own_realty      102386 non-null  object
 6   amt_income_total     102386 non-null  float64
 7   amt_credit           102386 non-null  float64
 8   name_income_type     102386 non-null  object
 9   name_education_type  102386 non-null  object
 10  name_family_status   102386 non-null  object
dtypes: float64(2), int64(2), object(7)
memory usage: 8.6+ MB

In [9]:
df['lti'] = df.amt_credit / df.amt_income_total
df.lti.median()

3.260869565217391

In [13]:
df[df['lti'] < df.lti.median()].default.value_counts(normalize=1)

default
0    0.918375
1    0.081625
Name: proportion, dtype: float64

In [14]:
df[df['lti'] > df.lti.median()].default.value_counts(normalize=1)

default
0    0.918693
1    0.081307
Name: proportion, dtype: float64

In [16]:
df.groupby('flag_own_car').default.value_counts(normalize=1)

flag_own_car  default
N             0          0.914459
              1          0.085541
Y             0          0.926354
              1          0.073646
Name: proportion, dtype: float64

In [17]:
df.groupby('flag_own_realty').default.value_counts(normalize=1)

flag_own_realty  default
N                0          0.914508
                 1          0.085492
Y                0          0.920316
                 1          0.079684
Name: proportion, dtype: float64